TestEDT/src/InformationRegisters/уа_СоответствияОбъектовУчета/уа_СоответствияОбъектовУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уа_СоответствияОбъектовУчета</name>
  <resources>
    <name>ОбъектУчета</name>
    <type>
      <types>Characteristic.уа_ВидыОбъектовИмпорта</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>DefinedType.уа_Идентификатор</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОбъектаИмпорта</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.уа_ВидыОбъектовИмпорта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИсточникДанных</name>
    <type>
      <types>CatalogRef.уа_ИсточникиДанных</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TestEDT/src/InformationRegisters/уа_СоответствияОбъектовУчета/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция НайтиОбъектПоИдентификатору(Идентификатор, ВидОбъекта, ИсточникДанных = Неопределено) Экспорт
	МенеджерЗаписи = РегистрыСведений.уа_СоответствияОбъектовУчета.СоздатьМенеджерЗаписи();	
	МенеджерЗаписи.Идентификатор	 	= Идентификатор;
	МенеджерЗаписи.ВидОбъектаИмпорта 	= ВидОбъекта;
	МенеджерЗаписи.ИсточникДанных 		= ИсточникДанных;
	МенеджерЗаписи.Прочитать();
	Если Не МенеджерЗаписи.Выбран() Тогда
		Возврат Неопределено;
	Иначе
		Возврат МенеджерЗаписи.ОбъектУчета;
	КонецЕсли;           
КонецФункции

Функция НайтиИдентификаторПоОбъекту(ОбъектУчета, ВидОбъекта, ИсточникДанных = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Идентификатор
		|ИЗ РегистрСведений.уа_СоответствияОбъектовУчета
		|ГДЕ ОбъектУчета = &ОбъектУчета И ВидОбъектаИмпорта = &ВидОбъекта И ИсточникДанных = &ИсточникДанных";
	
	Запрос.УстановитьПараметр("ОбъектУчета", ОбъектУчета);
	Запрос.УстановитьПараметр("ВидОбъекта", ВидОбъекта);
	Запрос.УстановитьПараметр("ИсточникДанных", ИсточникДанных);
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		ТЗ = Результат.Выгрузить();
		Возврат ТЗ[0].Идентификатор;
	КонецЕсли;                         	
КонецФункции

Процедура ДобавитьСоответствиеОбъекта(Идентификатор, ВидОбъекта, ОбъектУчета, ИсточникДанных = Неопределено) Экспорт 
	МенеджерЗаписи = РегистрыСведений.уа_СоответствияОбъектовУчета.СоздатьМенеджерЗаписи();	
	МенеджерЗаписи.Идентификатор	 	= Идентификатор;
	МенеджерЗаписи.ВидОбъектаИмпорта 	= ВидОбъекта;
	МенеджерЗаписи.ИсточникДанных 		= ИсточникДанных;
	МенеджерЗаписи.Прочитать();
	Если Не МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Идентификатор	 	= Идентификатор;
		МенеджерЗаписи.ВидОбъектаИмпорта 	= ВидОбъекта;
		МенеджерЗаписи.ИсточникДанных 		= ИсточникДанных;
		МенеджерЗаписи.ОбъектУчета		 	= ОбъектУчета;
		МенеджерЗаписи.ДатаДобавления 		= ТекущаяДата();
		МенеджерЗаписи.Записать(Истина);		
	КонецЕсли;                              	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
